Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажа") Тогда
		// Заполнение шапки
		Фирма = ДанныеЗаполнения.Салон;
		Продажа = ДанныеЗаполнения.Запись;
		Сотрудник = ДанныеЗаполнения.Коментарий;
		Услуга = ДанныеЗаполнения.услуга;
		Сумма = ДанныеЗаполнения.сумма;

	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
