
&НаКлиенте
Процедура выделетьВсё(Команда)
	Для Каждого Элемент Из Объект.РежимРаботы Цикл
		Элемент.РабочийДень=Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура снятьВыделение (Команда)
	Для Каждого Элемент Из Объект.РежимРаботы Цикл
		Элемент.РабочийДень= Ложь;
			КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СброситьВремя(Команда)
	Для Каждого Элемент Из Объект.РежимРаботы Цикл
		Элемент.Начало='000101010900';
		Элемент.Оканчание='000101011900';
	КонецЦикла;
КонецПроцедуры
