Функция ПолучитьИнформациюОбУслуги(Услуга, Дата) Экспорт
	
	Результат = Новый Структура("Длительность , Цена",  0, 0);

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК Цена,
	|	Услуги.Длительность
	|ИЗ
	|	Справочник.Услуги КАК Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&Дата, Услуга = &Услуга) КАК ЦеныСрезПоследних
	|		ПО Услуги.Ссылка = ЦеныСрезПоследних.Услуга
	|ГДЕ
	|	Услуги.Ссылка = &Услуга";
Запрос.УстановитьПараметр("Услуга", Услуга);
Запрос.УстановитьПараметр("Дата", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;	

КонецФункции
