&НаКлиенте
Процедура услугаПриИзменении(Элемент)
	Если Объект.услуга.Пустая() Тогда
		Объект.Длительность	= 0;
		Объект.сумма		= 0;
	Иначе
		
		ИнфомацияОбУслуге	= ДлительностьЦенаУслуги.ПолучитьИнформациюОбУслуги(Объект.услуга, Объект.Дата);
		Объект.Длительность	= ИнфомацияОбУслуге.Длительность;
		Объект.сумма		= ИнфомацияОбУслуге.Цена;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка =ложь;
КонецПроцедуры

