Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Запись") Тогда
		// Заполнение шапки
		Салон = ДанныеЗаполнения.Салон;
		сотрудники = ДанныеЗаполнения.сотрудники;
		клиент = ДанныеЗаполнения.клиент;
		услуга = ДанныеЗаполнения.услуга;
		Длительность = ДанныеЗаполнения.Длительность;
		сумма = ДанныеЗаполнения.сумма;
		Коментарий = ДанныеЗаполнения.Коментарий;
		Запись = ДанныеЗаполнения.Ссылка;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажа") Тогда
		// Заполнение шапки
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
